stm32-rs/stm32f4xx-hal/src/i2s.rs
#[cfg(any(feature = "stm32f446"))]
use crate::gpio::gpiog::PG11;
#[cfg(any(
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpiog::PG14;
#[cfg(any(
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpiog::{PG12, PG13};

#[cfg(any(
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpioh::{PH6, PH7};

#[cfg(any(
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpioi::{PI1, PI2, PI3};

#[cfg(any(
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f446"
))]
use crate::gpio::AF7;
#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::{Alternate, AF5, AF6, AF7};

use crate::rcc::Clocks;
use crate::time::Hertz;

/// I2S error
#[derive(Debug)]
pub enum Error {
    /// Overrun occurred
    Overrun,
    /// Mode fault occurred
    ModeFault,
    /// CRC error
    Crc,
    #[doc(hidden)]
    _Extensible,
}

pub trait Pins<I2S> {}
pub trait PinCk<I2S> {}
pub trait PinWs<I2S> {}
pub trait PinSd<I2S> {}
pub trait PinSdExt<I2S> {}

impl<I2S, CK, WS, SD, SDEXT> Pins<I2S> for (CK, WS, SD, SDEXT)
where
    CK: PinCk<I2S>,
    WS: PinWs<I2S>,
    SD: PinSd<I2S>,
    SDEXT: PinSdExt<I2S>,
{
}

/// A filler type for when the CK pin is unnecessary
pub struct NoCk;
/// A filler type for when the Ws pin is unnecessary
pub struct NoWs;
/// A filler type for when the Sd pin is unnecessary
pub struct NoSd;
/// A filler type for when the SdExt pin is unnecessary
pub struct NoSdExt;

macro_rules! pins {
    ($($SPIX:ty: CK: [$($CK:ty),*] WS: [$($WS:ty),*] SD: [$($SD:ty),*] SDEXT: [$($SDEXT:ty),*])+) => {
        $(
            $(
                impl PinCk<$SPIX> for $CK {}
            )*
            $(
                impl PinWs<$SPIX> for $WS {}
            )*
            $(
                impl PinSd<$SPIX> for $SD {}
            )*
            $(
                impl PinSdExt<$SPIX> for $SDEXT {}
            )*
        )+
    }
}

// #[cfg(any(
//     feature = "stm32f401",
//     feature = "stm32f405",
//     feature = "stm32f407",
//     feature = "stm32f410",
//     feature = "stm32f411",
//     feature = "stm32f412",
//     feature = "stm32f413",
//     feature = "stm32f415",
//     feature = "stm32f417",
//     feature = "stm32f423",
//     feature = "stm32f427",
//     feature = "stm32f429",
//     feature = "stm32f437",
//     feature = "stm32f439",
//     feature = "stm32f446",
//     feature = "stm32f469",
//     feature = "stm32f479"
// ))]
// pins! {
//     SPI1:
//         CK: [
//             NoCk,
//             PA5<Alternate<AF5>>,
//             PB3<Alternate<AF5>>
//         ]
//         WS: [] // TODO: Fill in.
//         SD: [
//             NoSd,
//             PA7<Alternate<AF5>>,
//             PB5<Alternate<AF5>>
//         ]
//         SDEXT: [
//             NoSdExt,
//             PA6<Alternate<AF5>>,
//             PB4<Alternate<AF5>>
//         ]

//     SPI2:
//         CK: [
//             NoCk,
//             PB10<Alternate<AF5>>,
//             PB13<Alternate<AF5>>
//         ]
//         WS: [] // TODO: Fill in.
//         SD: [
//             NoSd,
//             PB15<Alternate<AF5>>,
//             PC3<Alternate<AF5>>
//         ]
//         SDEXT: [
//             NoSdExt,
//             PB14<Alternate<AF5>>,
//             PC2<Alternate<AF5>>
//         ]
// }

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
pins! {
    SPI3:
        CK: [
            NoCk,
            PB3<Alternate<AF6>>,
            PC10<Alternate<AF6>>
        ]
        WS: [
            NoWs,
            PA4<Alternate<AF6>>,
            PA15<Alternate<AF6>>
        ]
        SD: [
            NoSd,
            PB5<Alternate<AF6>>,
            PC12<Alternate<AF6>>
        ]
        SDEXT: [
            NoSdExt,
            PB4<Alternate<AF7>>,
            PC11<Alternate<AF5>>
        ]
}

// #[cfg(any(
//     feature = "stm32f401",
//     feature = "stm32f411",
//     feature = "stm32f412",
//     feature = "stm32f413",
//     feature = "stm32f423",
//     feature = "stm32f427",
//     feature = "stm32f429",
//     feature = "stm32f437",
//     feature = "stm32f439",
//     feature = "stm32f446",
//     feature = "stm32f469",
//     feature = "stm32f479"
// ))]
// pins! {
//     SPI2:
//         CK: [PD3<Alternate<AF5>>]
//         WS: [] // TODO: Fill in.
//         SD: []
//         SDEXT: []
//     SPI3:
//         CK: []
//         WS: [] // TODO: Fill in.
//         SD: []
//         SDEXT: [PD6<Alternate<AF5>>]
//     SPI4:
//         CK: [
//             NoCk,
//             PE2<Alternate<AF5>>,
//             PE12<Alternate<AF5>>
//         ]
//         WS: [] // TODO: Fill in.
//         SD: [
//             NoSd,
//             PE6<Alternate<AF5>>,
//             PE14<Alternate<AF5>>
//         ]
//         SDEXT: [
//             NoSdExt,
//             PE5<Alternate<AF5>>,
//             PE13<Alternate<AF5>>
//         ]
// }

// #[cfg(any(
//     feature = "stm32f405",
//     feature = "stm32f407",
//     feature = "stm32f415",
//     feature = "stm32f417",
//     feature = "stm32f427",
//     feature = "stm32f429",
//     feature = "stm32f437",
//     feature = "stm32f439",
//     feature = "stm32f469",
//     feature = "stm32f479"
// ))]
// pins! {
//     SPI2:
//         CK: [PI1<Alternate<AF5>>]
//         WS: [] // TODO: Fill in.
//         SD: [PI3<Alternate<AF5>>]
//         SDEXT: [PI2<Alternate<AF5>>]
// }

// #[cfg(any(
//     feature = "stm32f410",
//     feature = "stm32f411",
//     feature = "stm32f412",
//     feature = "stm32f413",
//     feature = "stm32f423",
//     feature = "stm32f446"
// ))]
// pins! {
//     SPI2:
//         CK: [PC7<Alternate<AF5>>]
//         WS: [] // TODO: Fill in.
//         SD: []
//         SDEXT: []
// }

// #[cfg(any(
//     feature = "stm32f410",
//     feature = "stm32f411",
//     feature = "stm32f412",
//     feature = "stm32f413",
//     feature = "stm32f423"
// ))]
// pins! {
//     SPI5:
//         CK: [
//             NoCk,
//             PB0<Alternate<AF6>>
//         ]
//         WS: [] // TODO: Fill in.
//         SD: [
//             NoSd,
//             PA10<Alternate<AF6>>,
//             PB8<Alternate<AF6>>
//         ]
//         SDEXT: [
//             NoSdExt,
//             PA12<Alternate<AF6>>
//         ]
// }

// #[cfg(any(
//     feature = "stm32f411",
//     feature = "stm32f412",
//     feature = "stm32f413",
//     feature = "stm32f423"
// ))]
// pins! {
//     SPI3:
//         CK: [PB12<Alternate<AF7>>]
//         WS: [] // TODO: Fill in.
//         SD: []
//         SDEXT: []
//     SPI4:
//         CK: [PB13<Alternate<AF6>>]
//         WS: [] // TODO: Fill in.
//         SD: [PA1<Alternate<AF5>>]
//         SDEXT: [PA11<Alternate<AF6>>]
//     SPI5:
//         CK: [
//             PE2<Alternate<AF6>>,
//             PE12<Alternate<AF6>>
//         ]
//         WS: [] // TODO: Fill in.
//         SD: [
//             PE6<Alternate<AF6>>,
//             PE14<Alternate<AF6>>
//         ]
//         SDEXT: [
//             PE5<Alternate<AF6>>,
//             PE13<Alternate<AF6>>
//         ]
// }

// #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
// pins! {
//     SPI2:
//         CK: [PA9<Alternate<AF5>>]
//         WS: [] // TODO: Fill in.
//         SD: [PA10<Alternate<AF5>>]
//         SDEXT: [PA12<Alternate<AF5>>]
// }

// #[cfg(any(
//     feature = "stm32f427",
//     feature = "stm32f429",
//     feature = "stm32f437",
//     feature = "stm32f439",
//     feature = "stm32f469",
//     feature = "stm32f479"
// ))]
// pins! {
//     SPI5:
//         CK: [
//             NoCk,
//             PF7<Alternate<AF5>>,
//             PH6<Alternate<AF5>>
//         ]
//         WS: [] // TODO: Fill in.
//         SD: [
//             NoSd,
//             PF9<Alternate<AF5>>,
//             PF11<Alternate<AF5>>
//         ]
//         SDEXT: [
//             NoSdExt,
//             PF8<Alternate<AF5>>,
//             PH7<Alternate<AF5>>
//         ]

//     SPI6:
//         CK: [
//             NoCk,
//             PG13<Alternate<AF5>>
//         ]
//         WS: [] // TODO: Fill in.
//         SD: [
//             NoSd,
//             PG14<Alternate<AF5>>
//         ]
//         SDEXT: [
//             NoSdExt,
//             PG12<Alternate<AF5>>
//         ]
// }

// #[cfg(any(feature = "stm32f446"))]
// pins! {
//     SPI2:
//         CK: [PA9<Alternate<AF5>>]
//         WS: [] // TODO: Fill in.
//         SD: [PC1<Alternate<AF7>>]
//         SDEXT: []

