stm32-rs/stm32f4xx-hal/src/i2s.rs
//     SPI3:
//         CK: []
//         WS: [] // TODO: Fill in.
//         SD: [
//             PB0<Alternate<AF7>>,
//             PB2<Alternate<AF7>>,
//             PD0<Alternate<AF6>>
//         ]
//         SDEXT: []

//     SPI4:
//         CK: [PG11<Alternate<AF6>>]
//         WS: [] // TODO: Fill in.
//         SD: [PG13<Alternate<AF6>>]
//         SDEXT: [
//             PG12<Alternate<AF6>>,
//             PD0<Alternate<AF5>>
//         ]
// }

// #[cfg(any(feature = "stm32f469", feature = "stm32f479"))]
// pins! {
//     SPI2:
//         CK: [PA9<Alternate<AF5>>]
//         WS: [] // TODO: Fill in.
//         SD: [PC1<Alternate<AF5>>]
//         SDEXT: []
// }

// /// Interrupt events
// pub enum Event {
//     /// New data has been received
//     Rxne,
//     /// Data can be sent
//     Txe,
//     /// An error occurred
//     Error,
// }

#[derive(Debug)]
pub struct I2s<SPI, PINS> {
    spi: SPI,
    pins: PINS,
}

// #[cfg(any(
//     feature = "stm32f401",
//     feature = "stm32f405",
//     feature = "stm32f407",
//     feature = "stm32f410",
//     feature = "stm32f411",
//     feature = "stm32f412",
//     feature = "stm32f413",
//     feature = "stm32f415",
//     feature = "stm32f417",
//     feature = "stm32f423",
//     feature = "stm32f427",
//     feature = "stm32f429",
//     feature = "stm32f437",
//     feature = "stm32f439",
//     feature = "stm32f446",
//     feature = "stm32f469",
//     feature = "stm32f479"
// ))]
// impl<PINS> Spi<SPI1, PINS> {
//     pub fn spi1(spi: SPI1, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks) -> Self
//     where
//         PINS: Pins<SPI1>,
//     {
//         // NOTE(unsafe) This executes only during initialisation
//         let rcc = unsafe { &(*RCC::ptr()) };

//         // Enable clock for SPI
//         rcc.apb2enr.modify(|_, w| w.spi1en().set_bit());

//         Spi { spi, pins }.init(mode, freq, clocks.pclk2())
//     }
// }

// #[cfg(any(
//     feature = "stm32f401",
//     feature = "stm32f405",
//     feature = "stm32f407",
//     feature = "stm32f410",
//     feature = "stm32f411",
//     feature = "stm32f412",
//     feature = "stm32f413",
//     feature = "stm32f415",
//     feature = "stm32f417",
//     feature = "stm32f423",
//     feature = "stm32f427",
//     feature = "stm32f429",
//     feature = "stm32f437",
//     feature = "stm32f439",
//     feature = "stm32f446",
//     feature = "stm32f469",
//     feature = "stm32f479"
// ))]
// impl<PINS> Spi<SPI2, PINS> {
//     pub fn spi2(spi: SPI2, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks) -> Self
//     where
//         PINS: Pins<SPI2>,
//     {
//         // NOTE(unsafe) This executes only during initialisation
//         let rcc = unsafe { &(*RCC::ptr()) };

//         // Enable clock for SPI
//         rcc.apb1enr.modify(|_, w| w.spi2en().set_bit());

//         Spi { spi, pins }.init(mode, freq, clocks.pclk1())
//     }
// }

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl<PINS> I2s<SPI3, PINS> {
    pub fn i2s3(spi: SPI3, pins: PINS, freq: Hertz, clocks: Clocks) -> Self
    where
        PINS: Pins<SPI3>,
    {
        // NOTE(unsafe) This executes only during initialisation
        let rcc = unsafe { &(*RCC::ptr()) };

        // Enable clock for SPI
        rcc.apb1enr.modify(|_, w| w.spi3en().set_bit());

        // TODO: Use PLL I2S clock.
        // if clocks.plli2sclk().is_some() {
        //     I2s { spi, pins }.init(freq, clocks.plli2sclk())
        // }

        I2s { spi, pins }.init(freq, freq)
    }
}

// impl<PINS> I2s<SPI3, PINS> {
//     pub fn i2s3(spi: SPI3, pins: PINS, freq: Hertz, clocks: Clocks) -> Self
//     where
//         PINS: Pins<SPI3>,
//     {
//         // NOTE(unsafe) This executes only during initialisation
//         let rcc = unsafe { &(*RCC::ptr()) };

//         // Enable clock for SPI
//         rcc.apb1enr.modify(|_, w| w.spi3en().set_bit());

//         // TODO: Use Real clock value from  I2S PLL.
//         I2s { spi, pins }.init(freq, freq)
//     }
// }

// #[cfg(any(
//     feature = "stm32f401",
//     feature = "stm32f411",
//     feature = "stm32f412",
//     feature = "stm32f413",
//     feature = "stm32f423",
//     feature = "stm32f427",
//     feature = "stm32f429",
//     feature = "stm32f437",
//     feature = "stm32f439",
//     feature = "stm32f446",
//     feature = "stm32f469",
//     feature = "stm32f479"
// ))]
// impl<PINS> Spi<SPI4, PINS> {
//     pub fn spi4(spi: SPI4, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks) -> Self
//     where
//         PINS: Pins<SPI4>,
//     {
//         // NOTE(unsafe) This executes only during initialisation
//         let rcc = unsafe { &(*RCC::ptr()) };

//         // Enable clock for SPI
//         rcc.apb2enr.modify(|_, w| w.spi4en().set_bit());

//         Spi { spi, pins }.init(mode, freq, clocks.pclk2())
//     }
// }

// #[cfg(any(
//     feature = "stm32f410",
//     feature = "stm32f411",
//     feature = "stm32f412",
//     feature = "stm32f413",
//     feature = "stm32f423",
//     feature = "stm32f427",
//     feature = "stm32f429",
//     feature = "stm32f437",
//     feature = "stm32f439",
//     feature = "stm32f469",
//     feature = "stm32f479"
// ))]
// impl<PINS> Spi<SPI5, PINS> {
//     pub fn spi5(spi: SPI5, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks) -> Self
//     where
//         PINS: Pins<SPI5>,
//     {
//         // NOTE(unsafe) This executes only during initialisation
//         let rcc = unsafe { &(*RCC::ptr()) };

//         // Enable clock for SPI
//         rcc.apb2enr.modify(|_, w| w.spi5en().set_bit());

