stm32-rs/stm32f4xx-hal/src/i2s.rs
impl<SPI, PINS, W> Write<W> for I2s<SPI, PINS>
where
    SPI: Deref<Target = spi1::RegisterBlock>,
    W: Copy,
{
    type Error = Error;

    fn try_write<'w>(
        &mut self,
        left_words: &'w [W],
        right_words: &'w [W],
    ) -> Result<(), Self::Error> {
        // TODO: Check preconditions, return errors.
        for (lw, rw) in left_words.iter().zip(right_words.iter()) {
            while !self.is_txe() {} // Wait for TX enable after the previous word.
            unsafe { ptr::write_volatile(&self.spi.dr as *const _ as *mut W, *lw) }
            while !self.is_txe() {} // Wait for TX enable after the left word.
            unsafe { ptr::write_volatile(&self.spi.dr as *const _ as *mut W, *rw) }
        }
        Ok(())
    }
}

impl<SPI, PINS, W> WriteIter<W> for I2s<SPI, PINS>
where
    SPI: Deref<Target = spi1::RegisterBlock>,
    // W: Copy,
{
    type Error = Error;

    fn try_write_iter<LW, RW>(&mut self, left_words: LW, right_words: RW) -> Result<(), Self::Error>
    where
        LW: IntoIterator<Item = W>,
        RW: IntoIterator<Item = W>,
    {
        // TODO: Check preconditions, return errors.
        for (lw, rw) in left_words.into_iter().zip(right_words.into_iter()) {
            while !self.is_txe() {} // Wait for TX enable after the previous word.
            unsafe { ptr::write_volatile(&self.spi.dr as *const _ as *mut W, lw) }
            while !self.is_txe() {} // Wait for TX enable after the left word.
            unsafe { ptr::write_volatile(&self.spi.dr as *const _ as *mut W, rw) }
        }
        Ok(())
    }
}

// impl<SPI, PINS> spi::FullDuplex<u8> for Spi<SPI, PINS>
// where
//     SPI: Deref<Target = spi1::RegisterBlock>,
// {
//     type Error = Error;

//     fn read(&mut self) -> nb::Result<u8, Error> {
//         let sr = self.spi.sr.read();

//         Err(if sr.ovr().bit_is_set() {
//             nb::Error::Other(Error::Overrun)
//         } else if sr.modf().bit_is_set() {
//             nb::Error::Other(Error::ModeFault)
//         } else if sr.crcerr().bit_is_set() {
//             nb::Error::Other(Error::Crc)
//         } else if sr.rxne().bit_is_set() {
//             // NOTE(read_volatile) read only 1 byte (the svd2rust API only allows
//             // reading a half-word)
//             return Ok(unsafe { ptr::read_volatile(&self.spi.dr as *const _ as *const u8) });
//         } else {
//             nb::Error::WouldBlock
//         })
//     }

//     fn send(&mut self, byte: u8) -> nb::Result<(), Error> {
//         let sr = self.spi.sr.read();

//         Err(if sr.ovr().bit_is_set() {
//             nb::Error::Other(Error::Overrun)
//         } else if sr.modf().bit_is_set() {
//             nb::Error::Other(Error::ModeFault)
//         } else if sr.crcerr().bit_is_set() {
//             nb::Error::Other(Error::Crc)
//         } else if sr.txe().bit_is_set() {
//             // NOTE(write_volatile) see note above
//             unsafe { ptr::write_volatile(&self.spi.dr as *const _ as *mut u8, byte) }
//             return Ok(());
//         } else {
//             nb::Error::WouldBlock
//         })
//     }
// }

// impl<SPI, PINS> embedded_hal::blocking::spi::transfer::Default<u8> for Spi<SPI, PINS> where
//     SPI: Deref<Target = spi1::RegisterBlock>
// {
// }

// impl<SPI, PINS> embedded_hal::blocking::spi::write::Default<u8> for Spi<SPI, PINS> where
//     SPI: Deref<Target = spi1::RegisterBlock>
// {
// }
